benchmarking-results/orientdb_e3.dat
/usr/bin/java  -classpath /home/azureadmin/YCSB/conf:/home/azureadmin/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/azureadmin/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/azureadmin/YCSB/orientdb/target/orientdb-binding-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-analysis-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-commons-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-tree-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-util-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/commons-lang-2.6.jar:/home/azureadmin/YCSB/orientdb/target/dependency/concurrentlinkedhashmap-lru-1.4.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/hppc-0.8.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/icu4j-65.1.jar:/home/azureadmin/YCSB/orientdb/target/dependency/javax.activation-api-1.2.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9-native.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-a64asm-1.0.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-constants-0.10.3.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-ffi-2.2.11.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-posix-3.1.15.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-x86asm-1.0.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/log4j-1.2.17.jar:/home/azureadmin/YCSB/orientdb/target/dependency/lz4-java-1.4.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-client-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-core-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-api-1.7.25.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-log4j12-1.7.10.jar site.ycsb.Client -t -db site.ycsb.db.OrientDBClient -s -P workloads/workloadt -p orientdb.url=remote:database-vm-0/test -p orientdb.server.user=root -p orientdb.server.password=rootpwd -p orientdb.user=root -p orientdb.password=rootpwd -threads 10 -p requestdistribution=uniform -p operationcount=30000 -p transactionReadCount=90 -p transactionUpdateCount=10
[OVERALL], RunTime(ms), 2465783
[OVERALL], Throughput(ops/sec), 12.166520736009616
[TOTAL_GCS_G1_Young_Generation], Count, 585
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1528
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.06196814561540898
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 585
[TOTAL_GC_TIME], Time(ms), 1528
[TOTAL_GC_TIME_%], Time(%), 0.06196814561540898
[READ], Operations, 2700000
[READ], AverageLatency(us), 7030.401918518519
[READ], MinLatency(us), 522
[READ], MaxLatency(us), 551423
[READ], 95thPercentileLatency(us), 32831
[READ], 99thPercentileLatency(us), 47679
[READ], Return=OK, 2700000
[COMMIT], Operations, 30000
[COMMIT], AverageLatency(us), 70916.71613333334
[COMMIT], MinLatency(us), 6932
[COMMIT], MaxLatency(us), 1848319
[COMMIT], 95thPercentileLatency(us), 68287
[COMMIT], 99thPercentileLatency(us), 1539071
[COMMIT], Return=OK, 30000
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 2334.7
[CLEANUP], MinLatency(us), 1143
[CLEANUP], MaxLatency(us), 6611
[CLEANUP], 95thPercentileLatency(us), 6611
[CLEANUP], 99thPercentileLatency(us), 6611
[START], Operations, 30000
[START], AverageLatency(us), 1.2572
[START], MinLatency(us), 0
[START], MaxLatency(us), 2613
[START], 95thPercentileLatency(us), 3
[START], 99thPercentileLatency(us), 10
[START], Return=OK, 30000
[UPDATE], Operations, 300000
[UPDATE], AverageLatency(us), 10177.80777
[UPDATE], MinLatency(us), 1359
[UPDATE], MaxLatency(us), 484863
[UPDATE], 95thPercentileLatency(us), 35679
[UPDATE], 99thPercentileLatency(us), 49375
[UPDATE], Return=OK, 300000