benchmarking-results/orientdb_e4.dat
/usr/bin/java  -classpath /home/azureadmin/YCSB/conf:/home/azureadmin/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/azureadmin/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/azureadmin/YCSB/orientdb/target/orientdb-binding-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-analysis-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-commons-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-tree-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-util-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/commons-lang-2.6.jar:/home/azureadmin/YCSB/orientdb/target/dependency/concurrentlinkedhashmap-lru-1.4.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/hppc-0.8.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/icu4j-65.1.jar:/home/azureadmin/YCSB/orientdb/target/dependency/javax.activation-api-1.2.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9-native.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-a64asm-1.0.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-constants-0.10.3.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-ffi-2.2.11.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-posix-3.1.15.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-x86asm-1.0.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/log4j-1.2.17.jar:/home/azureadmin/YCSB/orientdb/target/dependency/lz4-java-1.4.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-client-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-core-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-api-1.7.25.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-log4j12-1.7.10.jar site.ycsb.Client -t -db site.ycsb.db.OrientDBClient -s -P workloads/workloadt -p orientdb.url=remote:database-vm-0/test -p orientdb.server.user=root -p orientdb.server.password=rootpwd -p orientdb.user=root -p orientdb.password=rootpwd -threads 10 -p requestdistribution=zipfian -p operationcount=30000 -p transactionReadCount=90 -p transactionUpdateCount=10
[OVERALL], RunTime(ms), 1918082
[OVERALL], Throughput(ops/sec), 15.640624332015003
[TOTAL_GCS_G1_Young_Generation], Count, 963
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1956
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.10197687064473782
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 963
[TOTAL_GC_TIME], Time(ms), 1956
[TOTAL_GC_TIME_%], Time(%), 0.10197687064473782
[READ], Operations, 2700000
[READ], AverageLatency(us), 5367.1400418518515
[READ], MinLatency(us), 534
[READ], MaxLatency(us), 1003519
[READ], 95thPercentileLatency(us), 28799
[READ], 99thPercentileLatency(us), 43103
[READ], Return=OK, 2700000
[COMMIT], Operations, 19889
[COMMIT], AverageLatency(us), 38844.24837850068
[COMMIT], MinLatency(us), 5104
[COMMIT], MaxLatency(us), 2531327
[COMMIT], 95thPercentileLatency(us), 50719
[COMMIT], 99thPercentileLatency(us), 711679
[COMMIT], Return=OK, 19889
[COMMIT], Return=ERROR, 10111
[COMMIT-FAILED], Operations, 10111
[COMMIT-FAILED], AverageLatency(us), 97722.37404806646
[COMMIT-FAILED], MinLatency(us), 3194
[COMMIT-FAILED], MaxLatency(us), 3495935
[COMMIT-FAILED], 95thPercentileLatency(us), 771583
[COMMIT-FAILED], 99thPercentileLatency(us), 1409023
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 4786.2
[CLEANUP], MinLatency(us), 1202
[CLEANUP], MaxLatency(us), 20223
[CLEANUP], 95thPercentileLatency(us), 20223
[CLEANUP], 99thPercentileLatency(us), 20223
[START], Operations, 30000
[START], AverageLatency(us), 0.921
[START], MinLatency(us), 0
[START], MaxLatency(us), 1732
[START], 95thPercentileLatency(us), 3
[START], 99thPercentileLatency(us), 8
[START], Return=OK, 30000
[UPDATE], Operations, 300000
[UPDATE], AverageLatency(us), 8185.14064
[UPDATE], MinLatency(us), 1323
[UPDATE], MaxLatency(us), 493823
[UPDATE], 95thPercentileLatency(us), 31503
[UPDATE], 99thPercentileLatency(us), 45343
[UPDATE], Return=OK, 300000