benchmarking-results/orientdb_load.dat
/usr/bin/java  -classpath /home/azureadmin/YCSB/conf:/home/azureadmin/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/azureadmin/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/azureadmin/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/azureadmin/YCSB/orientdb/target/orientdb-binding-0.18.0-SNAPSHOT.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-analysis-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-commons-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-tree-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/asm-util-9.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/commons-lang-2.6.jar:/home/azureadmin/YCSB/orientdb/target/dependency/concurrentlinkedhashmap-lru-1.4.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/hppc-0.8.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/icu4j-65.1.jar:/home/azureadmin/YCSB/orientdb/target/dependency/javax.activation-api-1.2.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9-native.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jffi-1.3.9.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-a64asm-1.0.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-constants-0.10.3.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-ffi-2.2.11.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-posix-3.1.15.jar:/home/azureadmin/YCSB/orientdb/target/dependency/jnr-x86asm-1.0.2.jar:/home/azureadmin/YCSB/orientdb/target/dependency/log4j-1.2.17.jar:/home/azureadmin/YCSB/orientdb/target/dependency/lz4-java-1.4.0.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-client-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/orientdb-core-3.1.20.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-api-1.7.25.jar:/home/azureadmin/YCSB/orientdb/target/dependency/slf4j-log4j12-1.7.10.jar site.ycsb.Client -load -db site.ycsb.db.OrientDBClient -s -P workloads/workloadt -p orientdb.url=remote:database-vm-0/test -p orientdb.server.user=root -p orientdb.server.password=rootpwd -p orientdb.user=root -p orientdb.password=rootpwd -p batchsize=1000
[OVERALL], RunTime(ms), 1143548
[OVERALL], Throughput(ops/sec), 4372.356910247755
[TOTAL_GCS_G1_Young_Generation], Count, 916
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 10566
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.9239664622735556
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 916
[TOTAL_GC_TIME], Time(ms), 10566
[TOTAL_GC_TIME_%], Time(%), 0.9239664622735556
[COMMIT], Operations, 5000000
[COMMIT], AverageLatency(us), 203.4855548
[COMMIT], MinLatency(us), 0
[COMMIT], MaxLatency(us), 4452351
[COMMIT], 95thPercentileLatency(us), 0
[COMMIT], 99thPercentileLatency(us), 0
[COMMIT], Return=OK, 5000000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 9116.0
[CLEANUP], MinLatency(us), 9112
[CLEANUP], MaxLatency(us), 9119
[CLEANUP], 95thPercentileLatency(us), 9119
[CLEANUP], 99thPercentileLatency(us), 9119
[START], Operations, 5000000
[START], AverageLatency(us), 0.3727674
[START], MinLatency(us), 0
[START], MaxLatency(us), 23535
[START], 95thPercentileLatency(us), 0
[START], 99thPercentileLatency(us), 0
[START], Return=OK, 5000000
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 21.4192292
[INSERT], MinLatency(us), 3
[INSERT], MaxLatency(us), 89919
[INSERT], 95thPercentileLatency(us), 4
[INSERT], 99thPercentileLatency(us), 7
[INSERT], Return=OK, 5000
[INSERT], Return=BATCHED_OK, 4995000